Revit 2024 API
FillPattern.ExpandDots Method
 Corrects pattern dots to make them be drawn properly for Revit.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public bool ExpandDots()
Visual Basic
Public Function ExpandDots As Boolean
Visual C++
public:
bool ExpandDots()
Return Value
 Indicates whether any dots were in fact expanded.
See Also
FillPattern Class
Autodesk.Revit.DB Namespace